import { Component, OnInit } from '@angular/core';
import { CommonModule } from '@angular/common';

@Component({
  selector: 'app-card-carousel',
  templateUrl: './card-carousel.component.html',
  styleUrls: ['./card-carousel.component.css'],
  standalone: true,
  imports: [CommonModule],
})
export class CardCarouselComponent implements OnInit {
  movies = [
    {
      title: 'Kung Fu Games 2024',
      genre: 'أكشن',
      quality: '1080p WEB-DL',
      rating: 6.5,
      image:
        'https://i.pinimg.com/236x/18/d7/4e/18d74ef46e722828f75cca91b009f4a5.jpg',
      description:
        'حكي هذا الفيلم عن رجل مشغول دائما في عمله. كان مشغولا لدرجة انه لا يوجد لديه وقت ليكون فيه مع عائلته. ولكنه لم يكن رجلا سيئا على الاطلاق, ولكنه كان يعتقد أن كسب الكثير من المال قد يجلب السعادة الى بيته. حتى حدث له شئ غريب في أحد الأيام. لقد عثر على جهاز تحكم سحري. من خلال الضغط على هذا الجهاز يمكن للوقت أن يمر سريعا. بدا له هذا الشئ في البداية على انه شئ لطيف. كان يساعده ذلك في سمع صوت الكلب وهو ينبح وكان يتخلص من الجدال مع زوجته من خلال الضغط على هذا الجهاز,حكي هذا الفيلم عن رجل مشغول دائما في عمله. كان مشغولا لدرجة انه لا يوجد لديه وقت ليكون فيه مع عائلته. ولكنه لم يكن رجلا سيئا على الاطلاق, ولكنه كان يعتقد أن كسب الكثير من المال قد يجلب السعادة الى بيته. حتى حدث له شئ غريب في أحد الأيام. لقد عثر على جهاز تحكم سحري. من خلال الضغط على هذا الجهاز يمكن للوقت أن يمر سريعا. بدا له هذا الشئ في البداية على انه شئ لطيف. كان يساعده ذلك في سمع صوت الكلب وهو ينبح وكان يتخلص من الجدال مع زوجته من خلال الضغط على هذا الجهاز,حكي هذا الفيلم عن رجل مشغول دائما في عمله. كان مشغولا لدرجة انه لا يوجد لديه وقت ليكون فيه مع عائلته. ولكنه لم يكن رجلا سيئا على الاطلاق, ولكنه كان يعتقد أن كسب الكثير من المال قد يجلب السعادة الى بيته. حتى حدث له شئ غريب في أحد الأيام. لقد عثر على جهاز تحكم سحري. من خلال الضغط على هذا الجهاز يمكن للوقت أن يمر سريعا. بدا له هذا الشئ في البداية على انه شئ لطيف. كان يساعده ذلك في سمع صوت الكلب وهو ينبح وكان يتخلص من الجدال مع زوجته من خلال الضغط على هذا الجهاز,فيلم مترجم اون لاين',
      expandedMovieId: null,
    },
    {
      title: 'Kung Fu Games 2024',
      genre: 'أكشن',
      quality: '1080p WEB-DL',
      rating: 6.5,
      image:
        'https://i.pinimg.com/236x/00/3c/63/003c63ff84c1f1954f64273da184f8fe.jpg',
      description:
        'حكي هذا الفيلم عن رجل مشغول دائما في عمله. كان مشغولا لدرجة انه لا يوجد لديه وقت ليكون فيه مع عائلته. ولكنه لم يكن رجلا سيئا على الاطلاق, ولكنه كان يعتقد أن كسب الكثير من المال قد يجلب السعادة الى بيته. حتى حدث له شئ غريب في أحد الأيام. لقد عثر على جهاز تحكم سحري. من خلال الضغط على هذا الجهاز يمكن للوقت أن يمر سريعا. بدا له هذا الشئ في البداية على انه شئ لطيف. كان يساعده ذلك في سمع صوت الكلب وهو ينبح وكان يتخلص من الجدال مع زوجته من خلال الضغط على هذا الجهاز,حكي هذا الفيلم عن رجل مشغول دائما في عمله. كان مشغولا لدرجة انه لا يوجد لديه وقت ليكون فيه مع عائلته. ولكنه لم يكن رجلا سيئا على الاطلاق, ولكنه كان يعتقد أن كسب الكثير من المال قد يجلب السعادة الى بيته. حتى حدث له شئ غريب في أحد الأيام. لقد عثر على جهاز تحكم سحري. من خلال الضغط على هذا الجهاز يمكن للوقت أن يمر سريعا. بدا له هذا الشئ في البداية على انه شئ لطيف. كان يساعده ذلك في سمع صوت الكلب وهو ينبح وكان يتخلص من الجدال مع زوجته من خلال الضغط على هذا الجهاز,حكي هذا الفيلم عن رجل مشغول دائما في عمله. كان مشغولا لدرجة انه لا يوجد لديه وقت ليكون فيه مع عائلته. ولكنه لم يكن رجلا سيئا على الاطلاق, ولكنه كان يعتقد أن كسب الكثير من المال قد يجلب السعادة الى بيته. حتى حدث له شئ غريب في أحد الأيام. لقد عثر على جهاز تحكم سحري. من خلال الضغط على هذا الجهاز يمكن للوقت أن يمر سريعا. بدا له هذا الشئ في البداية على انه شئ لطيف. كان يساعده ذلك في سمع صوت الكلب وهو ينبح وكان يتخلص من الجدال مع زوجته من خلال الضغط على هذا الجهاز, ',
      expandedMovieId: null,
    },
  ];

  isLoading = true;

  ngOnInit() {
    // Simulate fetching data asynchronously
    setTimeout(() => {
      this.isLoading = false;
    }, 2000);
  }

  showMore(movie: any): void {
    if (movie.expandedMovieId === movie.id) {
      movie.expandedMovieId = null; // Collapse if already expanded
    } else {
      movie.expandedMovieId = movie.id; // Expand the selected movie
    }
  }

  isExpanded(movie: any): boolean {
    return movie.expandedMovieId === movie.id;
  }
}
